wojtekgrzela/STM32CubeIDE/Zuk/Body_Computer/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include "../ErrorCodes/ErrorCodes.h"

#include <stdio.h>
#include <stdlib.h>
#include <inttypes.h>
#include <string.h>
#include <math.h>

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */


/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef enum
{
	MainMenu_Layer			=	0x00,
	Desktop_Layer			=	0x01,
	GPS_Layer				=	0x02,
	CarInfo_Layer			=	0x03,
	JarvisInfo_Layer		=	0x04,
	Last3Diag_Layer			=	0x05,
	Last3Err_Layer			=	0x06,
	CarSettings_Layer		=	0x07,
	BoardSettings_Layer		=	0x08,

	ClearDiagnosticSnapshots	=	0x71,
	ClearTripMileage			=	0x72,
	WaterSettings_Layer			=	0x73,
	OilTempSettings_Layer		=	0x74,
	OilPressureSettings_Layer	=	0x75,
	FuelSettings_Layer			=	0x76,
	MainBatterySettings_Layer	=	0x77,
	AuxBatterySettings_Layer	=	0x78,

	ClearErrorsSnapshots		=	0x81,
	AdjTimePoland				=	0x82,
	AdjTimeZone					=	0x83,
	InterVoltSettings_Layer		=	0x84,
	InterTempSettings_Layer		=	0x85,
	BuzzerSettings_Layer		=	0x86,
	LCDSettings_Layer			=	0x87,

	YesNo_Layer				=	0xF0,
	Ctrl_Layer				=	0xF1,

	Alarm_Layer				=	0xFF
}Enum_Layer;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef enum
{
	None_EnterAction			=	0x00,
	NotApplicable_EnterAction	=	0x00,
	No_EnterAction				=	0x00,

	GoInto_EnterAction			=	0x01,
	OnOff_EnterAction			=	0x02,
	YesNo_EnterAction			=	0x03,
	Ctrl_EnterAction			=	0x04,

	WinterSummer_EnterAction	=	0x10,

	Alarm_EnterAction			=	0xFF
}Enum_ActionForEnter;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef enum
{
	None_ScreenType				=	0x00,
	NotApplicable_ScreenType	=	0x00,
	No_ScreenType				=	0x00,

	OneScreen_ScreenType		=	0x01,
	ScrollList_ScreenType		=	0x02,
	YesNo_ScreenType			=	0x03,
	Ctrl_ScreenType				=	0x04,

	Alarm_ScreenType			=	0xFF
}Enum_ScreenType;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef enum
{
	Row1	=	0x00,
	Row2	=	0x01,
	Row3	=	0x02,
	Row4	=	0x03,
}Enum_LCDRow;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/* Diagnostic codes */
typedef enum
{
	DIAGNOSTICS_OK								= 0,

	WATER_TEMP_HIGH_WARNING						= 10,
	WATER_TEMP_HIGH_ALARM						= 11,

	OIL_TEMP_HIGH_WARNING						= 20,
	OIL_TEMP_HIGH_ALARM							= 21,

	LOW_VOLTAGE_MAIN_BATTERY_ALARM				= 30,
	HIGH_VOLTAGE_MAIN_BATTERY_ALARM				= 31,

	LOW_VOLTAGE_AUXILIARY_BATTERY_ALARM			= 40,
	HIGH_VOLTAGE_AUXILIARY_BATTERY_ALARM		= 41,

	UNKNOWN_ISSUE								= 0xF0F0F0F0
}Diagnostic_Code;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/* Diagnostic_Code Snapshot */
typedef struct
{
	Diagnostic_Code snapshotIdentificator;				//4 bytes total
	uint16_t value;										//8 bytes total (2 unused)

}Diagnostic_Snapshot_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/* Error_code Snapshot */
typedef struct
{
	Error_Code snapshotIdentificator;					//4 bytes total
	float value;										//8 bytes total
}Error_Snapshot_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/* ENCODER BUTTON STRUCT */
typedef union
{
	uint8_t allFlags;
	struct
	{
		uint8_t shortPressDetected		:1;	/* LSB!!! */
		uint8_t longPressDetected		:1;

		uint8_t longPressInfoForISR		:1;	/* This is an info for the external
												interrupt callback that there
												was a long press detected and
												not to set the short press on */
	};
}ENCButton_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	uint8_t waterHighTempWarningThreshold;
	uint8_t waterHighTempAlarmThreshold;
	uint8_t waterHighTempFanOnThreshold;
	uint8_t waterHighTempFanOffThreshold;

	union
	{
		uint8_t allSettings;
		struct
		{
			uint8_t waterTempWarningOn			:1;
			uint8_t waterTempAlarmOn			:1;
			uint8_t waterFanControlOn			:1;
			uint8_t waterTempWarningBuzzerOn	:1;
			uint8_t waterTempAlarmBuzzerOn		:1;
			uint8_t waterTempWarningSnapshotOn 	:1;
			uint8_t waterTempAlarmSnapshotOn	:1;
			/* 1 more free bits here */
		};
	};
}waterTempSettings_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	uint8_t oilHighTempWarningThreshold;
	uint8_t oilHighTempAlarmThreshold;

	union
	{
		uint8_t allSettings;
		struct
		{
			uint8_t oilTempWarningOn			:1;
			uint8_t oilTempAlarmOn				:1;
			uint8_t oilTempWarningBuzzerOn		:1;
			uint8_t oilTempAlarmBuzzerOn		:1;
			uint8_t oilTempWarningSnapshotOn	:1;
			uint8_t oilTempAlarmSnapshotOn		:1;
			/* 2 more free bits here */
		};
	};
}oilTempSettings_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	float batteryLowVoltageAlarmThreshold;
	float batteryHighVoltageAlarmThreshold;

	union
	{
		uint8_t allSettings;
		struct
		{
			uint8_t lowVoltageAlarmOn				:1;
			uint8_t highVoltageAlarmOn				:1;
			uint8_t lowVoltageAlarmBuzzerOn			:1;
			uint8_t highVoltageAlarmBuzzerOn		:1;
			uint8_t lowVoltageAlarmSnapshotOn		:1;
			uint8_t highVoltageAlarmSnapshotOn		:1;
			/* 2 more free bits here */
		};
	};
}batterySettings_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	uint8_t fuelLowLevelWarningThreshold;

	union
	{
		uint8_t allSettings;
		struct
		{
			uint8_t lowFuelLevelWarningOn			:1;
			uint8_t lowFuelLevelWarningBuzzerOn		:1;
		};
	};
}fuelSettings_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	uint8_t oilHighPressureAlarmThreshold;
	uint8_t oilLowPressureAlarmThreshold;

	union
	{
		uint8_t allSettings;
		struct
		{
			uint8_t oilPressureAnalogMeasurement	:1;
			uint8_t oilHighPressureAlarmOn			:1;
			uint8_t oilLowPressureAlarmOn			:1;
			uint8_t oilPressureAlarmBuzzerOn		:1;
			uint8_t oilPressureAlarmSnapshotOn		:1;
			/* 3 more free bits here */
		};
	};
}oilPressureSettings_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef union
{
	uint8_t data[8];
	struct
	{
		uint32_t totalMileage;
		uint32_t tripMileage;
	};
}CAR_mileage_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	uint8_t diagnosticSnapshotEEPROMIndex;
	uint8_t didTheNumberOfDiagnosticSnapshotsOverflowed;
	uint8_t mileageEEPROMIndex;
}CAR_EEPROM_counters_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	float board3V3SupplyLowThreshold;
	float board3V3SupplyHighThreshold;
	float board5VSupplyLowThreshold;
	float board5VSupplyHighThreshold;
	float boardVinSupplyLowThreshold;

	union
	{
		uint8_t allSettings;
		struct
		{
			uint8_t board3V3SupplyAlarmOn		:1;
			uint8_t board3V3SupplyBuzzerAlarmOn	:1;
			uint8_t board5VSupplyAlarmOn		:1;
			uint8_t board5VSupplyBuzzerAlarmON	:1;
			uint8_t boardVinSupplyAlarmOn		:1;
			uint8_t oardVinSupplyBuzzerAlarmOn	:1;
			/* 2 more free bits here */
		};
	};
}boardVoltagesSettings_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	float board5VDCDCTemperatureHighThreshold;
	float board3V3DCDCTemperatureHighThreshold;

	union
	{
		uint8_t allSettings;
		struct
		{
			uint8_t board5VDCDCTemperatureHighAlarmON			:1;
			uint8_t board5VDCDCTemperatureHighBuzzerAlarmOn		:1;
			uint8_t board3V3DCDCTemperatureHighAlarmOn			:1;
			uint8_t oard3V3DCDCTemperatureHighBuzzerAlarmOn	:1;
			/* 4 more free bits here */
		};
	};
}boardTemperaturesSettings_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	union
	{
		uint8_t allSettings;
		struct
		{
			uint8_t buzzerMainSwitchOn			:1;
			uint8_t buzzerMainAlarmsSwitchOn	:1;
			uint8_t buzzerMainButtonsSwitchOn	:1;
			uint8_t buzzerWhenShortPressOn		:1;
			uint8_t buzzerWhenLognPressOn		:1;
		};
	};
}buzzerMainSettings_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	Enum_Layer homeScreen;	// should be 4 bytes
	uint8_t autoHomeReturnTime;
	uint8_t backlightLevel;
	uint8_t secondsToAutoTurnOffBacklight;
	uint8_t autoBacklightOffHourStart;
	uint8_t autoBacklightOffHourEnd;

	union
	{
		uint8_t allSettings;
		struct
		{
			uint8_t autoBacklightOffAtNightOn	:1;
			/* 7 more free bits here */
		};
	};
}LCDMainSettings_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	uint8_t errorSnapshotEEPROMIndex;
	uint8_t didTheNumberOfErrorSnapshotsOverflowed;
}BOARD_EEPROM_counters_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	char name[21];		/* 20 for string, 21 for '\0', to be able to fill whole line in LCD */
	uint8_t nameActualSize;	/* Actual length of the name */

