wojtekgrzela/STM32CubeIDE/Zuk/Body_Computer/Core/Inc/main.h
	Enum_Layer layer;	/* Layer number as enum for cleaner code */
	Enum_ActionForEnter actionForEnter;	/* specifies type of action for short button click */
	Enum_ScreenType screenType;	/* Type of the screen (one board, list to scroll etc.) */

	Enum_Layer layerPrevious;	/* to know where to get back when long press is detected */
}LCDBoard;

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define OIL_PRESSURE_BINARY_IN_Pin GPIO_PIN_14
#define OIL_PRESSURE_BINARY_IN_GPIO_Port GPIOC
#define MEASURE_VIN_Pin GPIO_PIN_0
#define MEASURE_VIN_GPIO_Port GPIOC
#define MEASURE_5V_Pin GPIO_PIN_1
#define MEASURE_5V_GPIO_Port GPIOC
#define BOARD_TEMP_STABILIZER_Pin GPIO_PIN_2
#define BOARD_TEMP_STABILIZER_GPIO_Port GPIOC
#define BOARD_TEMP_DCDC_Pin GPIO_PIN_3
#define BOARD_TEMP_DCDC_GPIO_Port GPIOC
#define LM35_CarWaterTemp_Pin GPIO_PIN_2
#define LM35_CarWaterTemp_GPIO_Port GPIOA
#define BUZZER_Pin GPIO_PIN_2
#define BUZZER_GPIO_Port GPIOB
#define LED_8_Pin GPIO_PIN_10
#define LED_8_GPIO_Port GPIOE
#define LED_7_Pin GPIO_PIN_12
#define LED_7_GPIO_Port GPIOE
#define LED_6_Pin GPIO_PIN_15
#define LED_6_GPIO_Port GPIOE
#define I2C2_SCL_LCD_Pin GPIO_PIN_10
#define I2C2_SCL_LCD_GPIO_Port GPIOB
#define I2C2_SDA_LCD_Pin GPIO_PIN_11
#define I2C2_SDA_LCD_GPIO_Port GPIOB
#define ENC_BUTTON_Pin GPIO_PIN_12
#define ENC_BUTTON_GPIO_Port GPIOB
#define ENC_BUTTON_EXTI_IRQn EXTI15_10_IRQn
#define ENC_A_Pin GPIO_PIN_6
#define ENC_A_GPIO_Port GPIOC
#define ENC_B_Pin GPIO_PIN_7
#define ENC_B_GPIO_Port GPIOC
#define USART1_TX_GPS_Pin GPIO_PIN_9
#define USART1_TX_GPS_GPIO_Port GPIOA
#define USART1_RX_GPS_Pin GPIO_PIN_10
#define USART1_RX_GPS_GPIO_Port GPIOA
#define LED_5_Pin GPIO_PIN_0
#define LED_5_GPIO_Port GPIOD
#define LED_4_Pin GPIO_PIN_1
#define LED_4_GPIO_Port GPIOD
#define LED_3_Pin GPIO_PIN_3
#define LED_3_GPIO_Port GPIOD
#define LED_2_Pin GPIO_PIN_4
#define LED_2_GPIO_Port GPIOD
#define LED_1_Pin GPIO_PIN_7
#define LED_1_GPIO_Port GPIOD
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define I2C1_SCL_EEPROM_Pin GPIO_PIN_6
#define I2C1_SCL_EEPROM_GPIO_Port GPIOB
#define I2C1_SDA_EEPROM_Pin GPIO_PIN_7
#define I2C1_SDA_EEPROM_GPIO_Port GPIOB
#define EEPROM_WP_1_Pin GPIO_PIN_8
#define EEPROM_WP_1_GPIO_Port GPIOB
#define EEPROM_WP_2_Pin GPIO_PIN_9
#define EEPROM_WP_2_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
#define RUNTIME_STATS_AND_DEBUG

#ifdef RUNTIME_STATS_AND_DEBUG
#define RUNTIME_STATS_TIMER_CONFIG
#define RUNTIME_STATS_QUEUES
#endif
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */


/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/* TASKS & TIMERS FREQUENCIES */
#define MY_LCD_TASK_TIME_PERIOD				(TickType_t)(200)	/* MINIMUM: 100, for the 4x20 LCD it is needed approximately 80-85ms to send all data */
#define MY_GPS_TASK_TIME_PERIOD				(TickType_t)(1000)
#define MY_EEPROM_TASK_TIME_PERIOD			(TickType_t)(1000)	/* Would be good to decrease this number significantly, as it only executes when it has data from a Queue */
#define MY_DUMP_TO_EEPROM_TASK_TIME_PERIOD 	(TickType_t)(1000)
#define MY_DUMP_TO_SDCARD_TASK_TIME_PERIOD	(TickType_t)(1000)
#define MY_TASK_50_MS_TIME_PERIOD			(TickType_t)(50)
#define MY_TASK_250_MS_TIME_PERIOD			(TickType_t)(250)
#define MY_TASK_500_MS_TIME_PERIOD			(TickType_t)(500)
#define MY_TASK_1000_MS_TIME_PERIOD			(TickType_t)(1000)

#define DEBOUNCING_TIME_FOR_ENCODER_BUTTON	((uint32_t)(20))	/* Value in milliseconds */
#define ENC_BUTTON_LONG_PRESS_TIME			((uint32_t)(1000))	/* Value in milliseconds */
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/* FUNCTIONALITIES AND FEATURES */
#define BOARD_TEMPERATURE_MEASUREMENT
#define BOARD_VOLTAGE_MEASUREMENT

#define OIL_PRESSURE_BINARY_SENSOR
#define OIL_PRESSURE_ANALOG_SENSOR

#define GPS_RECEIVING
#ifdef GPS_RECEIVING
	#define GPS_PARSING
	#define GPS_ON_MICROSD_WRITE
#endif
#ifdef GPS_PARSING
	#define GPS_LCD_PRINT
#endif
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/* ADCs */
#define MAX_ADC_VALUE							((uint32_t)(4095))
#define REFERENCE_VOLTAGE						((float)(3.3))
#define NO_OF_ADC1_MEASURES						((uint32_t)(1))
#define NO_OF_ADC3_MEASURES						((uint32_t)(4))
#define MEASURE_VIN_VOLTAGE_DIVIDER				((float)(0.16016260))	/* R1/(R1+R2) = 1k/(1k+4.7k) ~ 0.17543859649 BUT after measuring: 0.16016260 */
#define MEASURE_5V_VOLTAGE_DIVIDER				((float)(0.444342629))	/* R1/(R1+R2) = 1.6k/(1.6k+1.6k) = 0.5000000 BUT after measuring: 0.444342629*/

#define ADC_RESOLUTION_X_REF_VOLTAGE_uint		(uint32_t)(1241)	/* 4095 / 3.3 ~ 1241 */
#define ADC_RESOLUTION_X_REF_VOLTAGE_float		(float)(1240.9091)	/* 4095 / 3.3 ~ 1240.9091 */
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/* Measurements */
#define NO_OF_ENGINE_WATER_TEMP_MEASUREMENTS_ADDED			((uint8_t)(4))
#define NO_OF_ENGINE_OIL_TEMP_MEASUREMENTS_ADDED			((uint8_t)(4))

#ifdef OIL_PRESSURE_ANALOG_SENSOR
#define NO_OF_ENGINE_OIL_PRESSURE_MEASUREMENTS_ADDED		((uint8_t)(4))
#endif
#ifdef OIL_PRESSURE_BINARY_SENSOR
#define GPIO_PORT_OIL_PRESSURE_SENSOR						(OIL_PRESSURE_BINARY_IN_GPIO_Port)
#define GPIO_PIN_OIL_PRESSURE_SENSOR						(OIL_PRESSURE_BINARY_IN_Pin)
#endif

#define NO_OF_MAIN_BATTERY_VOLTAGE_MEASUREMENTS_ADDED		((uint8_t)(4))
#define MAIN_BATTERY_VOLTAGE_DIVIDER						((float)(1.0))	//TODO
#define NO_OF_AUXILIARY_BATTERY_VOLTAGE_MEASUREMENTS_ADDED	((uint8_t)(4))	//TODO
#define AUXILIARY_BATTERY_VOLTAGE_DIVIDER					((float)(1.0))
#define NO_OF_FUEL_LEVEL_MEASUREMENTS_ADDED					((uint8_t)(5))
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/* Symbols */
#define TRUE									((uint8_t)(1))
#define True									((uint8_t)(1))
#define FALSE									((uint8_t)(0))
#define False									((uint8_t)(0))
#define NO										((uint8_t)(0))
#define No										((uint8_t)(0))
#define NOK										((uint8_t)(0))
#define YES										((uint8_t)(1))
#define Yes										((uint8_t)(1))
#define OK										((uint8_t)(1))
#define DEGREE_SYMBOL_LCD						((uint8_t)(0b11011111))
#define SPACE_IN_ASCII							((uint8_t)(0x20))
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/* EEPROM */
#define EEPROM_CAR_ADDRESS							((uint16_t)(0b10100000))
#define EEPROM_BOARD_ADDRESS						((uint16_t)(0b10100010))

#define EEPROM_CAR_BLOCK_PORT						(EEPROM_WP_1_GPIO_Port)
#define EEPROM_BOARD_BLOCK_PORT						(EEPROM_WP_2_GPIO_Port)
#define EEPROM_CAR_BLOCK_PIN						(EEPROM_WP_1_Pin)
#define EEPROM_BOARD_BLOCK_PIN						(EEPROM_WP_2_Pin)

#define EEPROM_PAGE_SIZE							((uint16_t)(64))

/* EEPROM CAR ADDRESSES AND SETTINGS */
#define TOTAL_SNAPSHOTS_NUMBER_ADDRESS							((uint16_t)(64))	/* 8 bit counter - 0-255 snapshots */
#define NUMBER_OF_DIAGNOSTIC_SNAPSHOTS_OVERFLOWED_ADDRESS		((uint16_t)(65))	/* indicates if the counter overflowed */

