wojtekgrzela/STM32CubeIDE/Zuk/Body_Computer/Core/Inc/main.h
#define TOTAL_MILEAGE_START_ADDRESS					((uint16_t)(128))
#define TRIP_MILEAGE_START_ADDRESS					((uint16_t)(132))
#define CAR_MILEAGE_TABLE_SIZE						((uint8_t)(10))

#define DIAGNOSTIC_SNAPSHOTS_START_ADDRESS			((uint16_t)(1024))	/* Max 255 diagnostic snapshots due to 8bit counter (add: 1024 - 17280) */

#define WATER_HIGH_TEMP_WARNING_THRESHOLD_ADDRESS	((uint16_t)(768))
#define WATER_HIGH_TEMP_ALARM_THRESHOLD_ADDRESS		((uint16_t)(769))
#define WATER_HIGH_TEMP_FAN_ON_THRESHOLD_ADDRESS	((uint16_t)(770))
#define WATER_HIGH_TEMP_FAN_OFF_THRESHOLD_ADDRESS	((uint16_t)(771))
#define WATER_TEMP_ALL_SETTINGS_ADDRESS				((uint16_t)(772))

#define OIL_HIGH_TEMP_WARNING_THRESHOLD_ADDRESS		((uint16_t)(778))
#define OIL_HIGH_TEMP_ALARM_THRESHOLD_ADDRESS		((uint16_t)(779))
#define OIL_TEMP_ALL_SETTINGS_ADDRESS				((uint16_t)(780))

#define MAIN_BATTERY_LOW_VOLTAGE_ALARM_THRESHOLD_ADDRESS		((uint16_t)(788))	/* 4 bytes value! (float) */
#define MAIN_BATTERY_HIGH_VOLTAGE_ALARM_THRESHOLD_ADDRESS		((uint16_t)(792))	/* 4 bytes value! (float) */
#define MAIN_BATTERY_ALL_SETTINGS_ADDRESS						((uint16_t)(796))

#define AUXILIARY_BATTERY_LOW_VOLTAGE_ALARM_THRESHOLD_ADDRESS	((uint16_t)(798))	/* 4 bytes value! (float) */
#define AUXILIARY_BATTERY_HIGH_VOLTAGE_ALARM_THRESHOLD_ADDRESS	((uint16_t)(802))	/* 4 bytes value! (float) */
#define AUXILIARY_BATTERY_ALL_SETTINGS_ADDRESS					((uint16_t)(806))

#define FUEL_LOW_LEVEL_WARNING_THRESHOLD_ADDRESS				((uint16_t)(808))
#define FUEL_ALL_SETTINGS_ADDRESS								((uint16_t)(810))

#define OIL_HIGH_PRESSURE_ALARM_THRESHOLD_ADDRESS				((uint16_t)(818))
#define OIL_LOW_PRESSURE_ALARM_THRESHOLD_ADDRESS				((uint16_t)(819))
#define OIL_PRESSURE_ALL_SETTINGS_ADDRESS						((uint16_t)(820))

#define ERROR_SNAPSHOTS_START_ADDRESS				((uint16_t)(1024))	/* Max 255 diagnostic snapshots due to 8bit counter (add: 1024 - 17280) */

/* EEPROM BOARD ADDRESSES AND SETTINGS */
#define NUMBER_OF_ERROR_SNAPSHOTS							((uint16_t)(64))	/* 8 bit counter - 0-255 snapshots */
#define NUMBER_OF_ERROR_SNAPSHOTS_OVERFLOWED_ADDRESS		((uint16_t)(65))	/* indicates if the counter overflowed */

#define HOME_LATITUDE_ADDRESS								((uint16_t)(128))	/* (float) Home GPS coordinates as a float (8 bytes for potential "double" usage) */
#define HOME_LONGITUDE_ADDRESS								((uint16_t)(136))	/* (float) Home GPS coordinates as a float (8 bytes for potential "double" usage) */
#define TIME_ZONE_ADJ_POLAND_ADDRESS						((uint16_t)(144))	/* "1" in winter and "2" in summer (time adjustment for UTC+0 */
#define TIME_MANUAL_ADJUSTMENT_ADDRESS						((uint16_t)(148))	/* "+-12h" in order to be able to adjust to the time zone */

#define BOARD_5V_SUPPLY_LOW_THRESHOLD_ADDRESS					((uint16_t)(256))
#define BOARD_5V_SUPPLY_HIGH_THRESHOLD_ADDRESS					((uint16_t)(260))
#define BOARD_3V3_SUPPLY_LOW_THRESHOLD_ADDRESS					((uint16_t)(264))
#define BOARD_3V3_SUPPLY_HIGH_THRESHOLD_ADDRESS					((uint16_t)(268))
#define BOARD_VIN_SUPPLY_LOW_THRESHOLD_ADDRESS					((uint16_t)(272))
#define BOARD_VOLTAGE_ALL_SETTINGS_ADDRESS						((uint16_t)(276))

#define BOARD_5V_TEMPERATURE_THRESHOLD_ADDRESS					((uint16_t)(280))
#define BOARD_3V3_TEMPERATURE_THRESHOLD_ADDRESS					((uint16_t)(284))
#define BOARD_TEMPERATURE_ALL_SETTINGS_ADDRESS					((uint16_t)(288))

#define BOARD_BUZZER_ALL_SETTINGS_ADDRESS						((uint16_t)(300))

#define BOARD_LCD_HOME_SCREEN_ADDRESS							((uint16_t)(320))
#define BOARD_LCD_AUTO_HOME_RETURN_TIME_ADDRESS					((uint16_t)(321))
#define BOARD_LCD_BACKLIGHT_LEVEL_ADDRESS						((uint16_t)(322))
#define BOARD_LCD_SECONDS_TO_AUTO_TURN_OFF_BACKLIGHT_ADDRESS	((uint16_t)(323))
#define BOARD_LCD_AUTO_BACKLIGHT_OFF_HOUR_START_ADDRESS			((uint16_t)(324))
#define BOARD_LCD_AUTO_BACKLIGHT_OFF_HOUR_END_ADDRESS			((uint16_t)(325))
#define BOARD_LCD_ALL_SETTINGS_ADDRESS							((uint16_t)(330))

#define ERROR_SNAPSHOTS_START_ADDRESS				((uint16_t)(1024))	/* Max 255 error snapshots due to 8bit counter (add: 1024 - 17280) */
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/* LCD */
#define NO_OF_ROWS_IN_LCD		((uint8_t)(4))
#define NO_OF_COLUMNS_IN_LCD	((uint8_t)(20))
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/* SD CARD */
#define TEST_MESSAGE_FOR_CHECK		("This is a test text.")
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */


/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
